{"id":"eed811bb-3be1-416a-8fe0-84433e16ce09","updated_at":"2024-11-18T22:53:11.319Z","updated_by":"elastic","created_at":"2024-11-18T22:53:11.319Z","created_by":"elastic","name":"Potential Linux FTP Brute Force Attack Detected","tags":["Data Source: Auditd Manager","Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Credential Access"],"interval":"5m","enabled":true,"revision":0,"description":"An FTP (file transfer protocol) brute force attack is a method where an attacker systematically tries different combinations of usernames and passwords to gain unauthorized access to an FTP server, and if successful, the impact can include unauthorized data access, manipulation, or theft, compromising the security and integrity of the server and potentially exposing sensitive information. This rule identifies multiple consecutive authentication failures targeting a specific user account from the same source address and within a short time interval, followed by a successful authentication.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"df6d8adb-1b03-4f59-bcaf-9b488faf265e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/","subtechnique":[{"id":"T1110.001","name":"Password Guessing","reference":"https://attack.mitre.org/techniques/T1110/001/"},{"id":"T1110.003","name":"Password Spraying","reference":"https://attack.mitre.org/techniques/T1110/003/"}]}]}],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["auditbeat-*","logs-auditd_manager.auditd-*"],"query":"sequence by host.id, auditd.data.addr, related.user with maxspan=5s\n  [authentication where host.os.type == \"linux\" and event.action == \"authenticated\" and\n   auditd.data.terminal == \"ftp\" and event.outcome == \"failure\" and auditd.data.addr != null and\n   auditd.data.addr != \"0.0.0.0\" and auditd.data.addr != \"::\"] with runs=3\n","filters":[],"actions":[]}
{"id":"b8c1746a-ba6b-4c5e-9fc9-63e758dbb33a","updated_at":"2024-11-18T22:53:11.327Z","updated_by":"elastic","created_at":"2024-11-18T22:53:11.327Z","created_by":"elastic","name":"Potential Linux SSH Brute Force Detected","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Credential Access"],"interval":"5m","enabled":true,"revision":0,"description":"Identifies multiple internal consecutive login failures targeting a user account from the same source address within a short time interval. Adversaries will often brute force login attempts across multiple users with a common or known password, in an attempt to gain access to these accounts.","risk_score":47,"severity":"medium","note":"## Triage and analysis\n\n### Investigating Potential Internal Linux SSH Brute Force Detected\n\nThe rule identifies consecutive internal SSH login failures targeting a user account from the same source IP address to the same target host indicating brute force login attempts.\n\n#### Possible investigation steps\n\n- Investigate the login failure user name(s).\n- Investigate the source IP address of the failed ssh login attempt(s).\n- Investigate other alerts associated with the user/host during the past 48 hours.\n- Identify the source and the target computer and their roles in the IT environment.\n\n### False positive analysis\n\n- Authentication misconfiguration or obsolete credentials.\n- Service account password expired.\n- Infrastructure or availability issue.\n\n### Related Rules\n\n- Potential External Linux SSH Brute Force Detected - fa210b61-b627-4e5e-86f4-17e8270656ab\n- Potential SSH Password Guessing - 8cb84371-d053-4f4f-bce0-c74990e28f28\n\n### Response and remediation\n\n- Initiate the incident response process based on the outcome of the triage.\n- Isolate the involved hosts to prevent further post-compromise behavior.\n- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business systems, and web services.\n- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and malware components.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).\n","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"4a01d545-537c-4216-a682-968a48c18940","max_signals":5,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/","subtechnique":[{"id":"T1110.001","name":"Password Guessing","reference":"https://attack.mitre.org/techniques/T1110/001/"},{"id":"T1110.003","name":"Password Spraying","reference":"https://attack.mitre.org/techniques/T1110/003/"}]}]}],"to":"now","references":[],"version":10,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-system.auth-*"],"query":"sequence by host.id, source.ip, user.name with maxspan=15s\n  [ authentication where host.os.type == \"linux\" and \n   event.action in (\"ssh_login\", \"user_login\") and event.outcome == \"failure\" and\n   cidrmatch(source.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",\n       \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\",\n       \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\",\n       \"100.64.0.0/10\", \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \n       \"::1\", \"FE80::/10\", \"FF00::/8\") ] with runs = 3\n","filters":[],"actions":[]}
{"id":"fddffa17-5cdd-44a6-bf48-e9dc199b880d","updated_at":"2024-11-18T23:09:57.680Z","updated_by":"elastic","created_at":"2024-11-18T22:53:11.334Z","created_by":"elastic","name":"Flag found","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"identify when the flag is found","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://127.0.0.1:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"9addaad2-9144-45f7-bc20-1778544c18e4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0009","name":"Collection","reference":"https://attack.mitre.org/tactics/TA0009"},"technique":[{"id":"T1005","name":"Data from Local System","reference":"https://attack.mitre.org/techniques/T1005","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"event.category : \"process\" and event.action : \"text_output\" and process.command_line : *flag.txt*","filters":[],"actions":[]}
{"id":"a1e9f8f1-7d75-4146-ac8e-4d66a78665ed","updated_at":"2024-11-18T22:53:11.328Z","updated_by":"elastic","created_at":"2024-11-18T22:53:11.328Z","created_by":"elastic","name":"SSH successful Login","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Identify successful Login.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://127.0.0.1:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"2736fac2-3a50-42c5-befa-a4433c131c42","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"event.category : \"authentication\" and event.action : \"logged-in\" and event.outcome : \"success\" and not user.name : (\"root\" or \"ubuntu\")","filters":[],"actions":[]}
{"exported_count":4,"exported_rules_count":4,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}