{"id":"ae18edb6-c477-4d3e-9fea-2e59e4f8a8fd","updated_at":"2024-04-13T20:09:30.949Z","updated_by":"elastic","created_at":"2024-04-13T18:47:02.687Z","created_by":"elastic","name":"Potential Linux SSH Brute Force Detected","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Credential Access"],"interval":"5m","enabled":true,"revision":1,"description":"Identifies multiple internal consecutive login failures targeting a user account from the same source address within a short time interval. Adversaries will often brute force login attempts across multiple users with a common or known password, in an attempt to gain access to these accounts.","risk_score":47,"severity":"medium","note":"## Triage and analysis\n\n### Investigating Potential Internal Linux SSH Brute Force Detected\n\nThe rule identifies consecutive internal SSH login failures targeting a user account from the same source IP address to the same target host indicating brute force login attempts.\n\n#### Possible investigation steps\n\n- Investigate the login failure user name(s).\n- Investigate the source IP address of the failed ssh login attempt(s).\n- Investigate other alerts associated with the user/host during the past 48 hours.\n- Identify the source and the target computer and their roles in the IT environment.\n\n### False positive analysis\n\n- Authentication misconfiguration or obsolete credentials.\n- Service account password expired.\n- Infrastructure or availability issue.\n\n### Related Rules\n\n- Potential External Linux SSH Brute Force Detected - fa210b61-b627-4e5e-86f4-17e8270656ab\n- Potential SSH Password Guessing - 8cb84371-d053-4f4f-bce0-c74990e28f28\n\n### Response and remediation\n\n- Initiate the incident response process based on the outcome of the triage.\n- Isolate the involved hosts to prevent further post-compromise behavior.\n- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business systems, and web services.\n- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and malware components.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).\n","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"4a01d545-537c-4216-a682-968a48c18940","max_signals":5,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/","subtechnique":[{"id":"T1110.001","name":"Password Guessing","reference":"https://attack.mitre.org/techniques/T1110/001/"},{"id":"T1110.003","name":"Password Spraying","reference":"https://attack.mitre.org/techniques/T1110/003/"}]}]}],"to":"now","references":[],"version":10,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-system.auth-*"],"query":"sequence by host.id, source.ip, user.name with maxspan=15s\n  [ authentication where host.os.type == \"linux\" and \n   event.action in (\"ssh_login\", \"user_login\") and event.outcome == \"failure\" and\n   cidrmatch(source.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",\n       \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\",\n       \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\",\n       \"100.64.0.0/10\", \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \n       \"::1\", \"FE80::/10\", \"FF00::/8\") ] with runs = 3\n","filters":[],"actions":[]}
{"id":"33b880cf-2561-4e88-8071-d53ed64d10e3","updated_at":"2024-04-13T20:13:55.654Z","updated_by":"elastic","created_at":"2024-04-13T20:13:46.743Z","created_by":"elastic","name":"Suspicious System Commands Executed by Previously Unknown Executable [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Execution","Data Source: Elastic Endgame","Data Source: Elastic Defend"],"interval":"5m","enabled":true,"revision":1,"description":"This rule monitors for the execution of several commonly used system commands executed by a previously unknown executable located in commonly abused directories. An alert from this rule can indicate the presence of potentially malicious activity, such as the execution of unauthorized or suspicious processes attempting to run malicious code. Detecting and investigating such behavior can help identify and mitigate potential security threats, protecting the system and its data from potential compromise.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"61e2d1d7-9075-42d6-b9a2-5df849b1b641","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.004","name":"Unix Shell","reference":"https://attack.mitre.org/techniques/T1059/004/"}]}]}],"to":"now","references":[],"version":105,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"new_terms","query":"host.os.type:linux and event.category:process and event.action:(exec or exec_event or fork or fork_event) and \nprocess.executable:(\n  /bin/* or /usr/bin/* or /usr/share/* or /tmp/* or /var/tmp/* or /dev/shm/* or\n  /etc/init.d/* or /etc/rc*.d/* or /etc/crontab or /etc/cron.*/* or /etc/update-motd.d/* or \n  /usr/lib/update-notifier/* or /home/*/.* or /boot/* or /srv/* or /run/*) \n  and process.args:(whoami or id or hostname or uptime or top or ifconfig or netstat or route or ps or pwd or ls) and \n  not process.name:(sudo or which or whoami or id or hostname or uptime or top or netstat or ps or pwd or ls or apt or \n  dpkg or yum or rpm or dnf or dockerd or docker or snapd or snap) and\n  not process.parent.executable:(/bin/* or /usr/bin/* or /run/k3s/* or /etc/network/* or /opt/Elastic/*)\n","new_terms_fields":["host.id","user.id","process.executable"],"history_window_start":"now-14d","index":["logs-endpoint.events.*","endgame-*"],"filters":[],"language":"kuery","actions":[]}
{"id":"b655056d-b82b-4854-a2f5-a715a049e0fa","updated_at":"2024-04-13T20:09:39.542Z","updated_by":"elastic","created_at":"2024-04-13T18:44:41.132Z","created_by":"elastic","name":"Potential Linux FTP Brute Force Attack Detected","tags":["Data Source: Auditd Manager","Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Credential Access"],"interval":"5m","enabled":true,"revision":1,"description":"An FTP (file transfer protocol) brute force attack is a method where an attacker systematically tries different combinations of usernames and passwords to gain unauthorized access to an FTP server, and if successful, the impact can include unauthorized data access, manipulation, or theft, compromising the security and integrity of the server and potentially exposing sensitive information. This rule identifies multiple consecutive authentication failures targeting a specific user account from the same source address and within a short time interval, followed by a successful authentication.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"df6d8adb-1b03-4f59-bcaf-9b488faf265e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/","subtechnique":[{"id":"T1110.001","name":"Password Guessing","reference":"https://attack.mitre.org/techniques/T1110/001/"},{"id":"T1110.003","name":"Password Spraying","reference":"https://attack.mitre.org/techniques/T1110/003/"}]}]}],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["auditbeat-*","logs-auditd_manager.auditd-*"],"query":"sequence by host.id, auditd.data.addr, related.user with maxspan=5s\n  [authentication where host.os.type == \"linux\" and event.action == \"authenticated\" and\n   auditd.data.terminal == \"ftp\" and event.outcome == \"failure\" and auditd.data.addr != null and\n   auditd.data.addr != \"0.0.0.0\" and auditd.data.addr != \"::\"] with runs=3\n","filters":[],"actions":[]}
{"id":"7766efad-74f5-462e-826c-789b0ef773fa","updated_at":"2024-04-13T20:09:25.991Z","updated_by":"elastic","created_at":"2024-04-13T19:27:35.230Z","created_by":"elastic","name":"SSH successful Login","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Identify successful Login.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://127.0.0.1:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"2736fac2-3a50-42c5-befa-a4433c131c42","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"event.category : \"authentication\" and event.action : \"logged-in\" and event.outcome : \"success\" and not user.name : (\"root\" or \"ubuntu\")","filters":[],"actions":[]}
{"id":"d9d8ee72-2680-4bcd-a3b5-3948e93b523e","updated_at":"2024-04-13T20:14:58.227Z","updated_by":"elastic","created_at":"2024-04-13T20:14:48.371Z","created_by":"elastic","name":"SUID/SGUID Enumeration Detected [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Tactic: Privilege Escalation","Data Source: Elastic Defend"],"interval":"5m","enabled":true,"revision":1,"description":"This rule monitors for the usage of the \"find\" command in conjunction with SUID and SGUID permission arguments. SUID (Set User ID) and SGID (Set Group ID) are special permissions in Linux that allow a program to execute with the privileges of the file owner or group, respectively, rather than the privileges of the user running the program. In case an attacker is able to enumerate and find a binary that is misconfigured, they might be able to leverage this misconfiguration to escalate privileges by exploiting vulnerabilities or built-in features in the privileged program.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"c6136640-3447-4241-b841-c7c6cd5f422a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1083","name":"File and Directory Discovery","reference":"https://attack.mitre.org/techniques/T1083/","subtechnique":[]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548/","subtechnique":[{"id":"T1548.001","name":"Setuid and Setgid","reference":"https://attack.mitre.org/techniques/T1548/001/"}]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[]}],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*"],"query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and \nprocess.name == \"find\" and process.args : \"-perm\" and process.args : (\n  \"/6000\", \"-6000\", \"/4000\", \"-4000\", \"/2000\", \"-2000\", \"/u=s\", \"-u=s\", \"/g=s\", \"-g=s\", \"/u=s,g=s\", \"/g=s,u=s\"\n) and not (\n  user.Ext.real.id == \"0\" or group.Ext.real.id == \"0\" or process.args_count >= 12 or \n  (process.args : \"/usr/bin/pkexec\" and process.args : \"-xdev\" and process.args_count == 7)\n)\n","filters":[],"actions":[]}
{"id":"2041f0db-e28a-4ad4-af32-50fa91ed3add","updated_at":"2024-04-13T20:15:24.012Z","updated_by":"elastic","created_at":"2024-04-13T20:15:11.686Z","created_by":"elastic","name":"Unusual User Privilege Enumeration via id [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Data Source: Elastic Defend"],"interval":"5m","enabled":true,"revision":1,"description":"This rule monitors for a sequence of 20 \"id\" command executions within 1 second by the same parent process. This behavior is unusual, and may be indicative of the execution of an enumeration script such as LinPEAS or LinEnum. These scripts leverage the \"id\" command to enumerate the privileges of all users present on the system.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"4c498c31-6c0f-4e86-86d7-e2f90d596bf7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1033","name":"System Owner/User Discovery","reference":"https://attack.mitre.org/techniques/T1033/","subtechnique":[]}]}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*"],"query":"sequence by host.id, process.parent.entity_id with maxspan=1s\n  [process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and \n   process.name == \"id\" and process.args_count == 2 and \n   not (process.parent.name == \"rpm\" or process.parent.args : \"/var/tmp/rpm-tmp*\")] with runs=20\n","filters":[],"actions":[]}
{"id":"37264104-cc09-4283-b456-1d3e7e9c8bc7","updated_at":"2024-04-13T20:15:57.471Z","updated_by":"elastic","created_at":"2024-04-13T20:15:50.116Z","created_by":"elastic","name":"Potential Shadow File Read via Command Line Utilities [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Privilege Escalation","Tactic: Credential Access","Data Source: Elastic Endgame","Data Source: Elastic Defend"],"interval":"5m","enabled":true,"revision":1,"description":"Identifies access to the /etc/shadow file via the commandline using standard system utilities. After elevating privileges to root, threat actors may attempt to read or dump this file in order to gain valid credentials. They may utilize these to move laterally undetected and access additional resources.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"f6fe604c-3940-4655-ab4f-cb1fb1a2b768","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1068","name":"Exploitation for Privilege Escalation","reference":"https://attack.mitre.org/techniques/T1068/","subtechnique":[]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/","subtechnique":[{"id":"T1003.008","name":"/etc/passwd and /etc/shadow","reference":"https://attack.mitre.org/techniques/T1003/008/"}]}]}],"to":"now","references":["https://www.cyberciti.biz/faq/unix-linux-password-cracking-john-the-ripper/"],"version":208,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"new_terms","query":"host.os.type : \"linux\" and event.category : \"process\" and event.action : (\"exec\" or \"exec_event\") and\n(process.args : \"/etc/shadow\" or (process.working_directory: \"/etc\" and process.args: \"shadow\")) and not \n(process.executable : (\"/bin/chown\" or \"/usr/bin/chown\") and process.args : \"root:shadow\") and not \n(process.executable : (\"/bin/chmod\" or \"/usr/bin/chmod\") and process.args : \"640\")\n","new_terms_fields":["process.command_line","host.id","process.executable"],"history_window_start":"now-10d","index":["logs-endpoint.events.*","endgame-*"],"filters":[],"language":"kuery","actions":[]}
{"id":"1196d6f4-8e26-4a93-93c8-d52de0b43cd2","updated_at":"2024-04-13T20:16:22.726Z","updated_by":"elastic","created_at":"2024-04-13T20:16:10.980Z","created_by":"elastic","name":"Potential Linux Hack Tool Launched [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Execution","Data Source: Elastic Endgame","Data Source: Elastic Defend","Data Source: Auditd Manager"],"interval":"5m","enabled":true,"revision":1,"description":"Monitors for the execution of different processes that might be used by attackers for malicious intent. An alert from this rule should be investigated further, as hack tools are commonly used by blue teamers and system administrators as well.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"3c715266-2f63-4c12-8f5d-4469e283235c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[]}],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*","endgame-*","auditbeat-*","logs-auditd_manager.auditd-*"],"query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"exec_event\", \"executed\", \"process_started\")\n and process.name in (\n  // exploitation frameworks\n  \"crackmapexec\", \"msfconsole\", \"msfvenom\", \"sliver-client\", \"sliver-server\", \"havoc\",\n  // network scanners (nmap left out to reduce noise)\n  \"zenmap\", \"nuclei\", \"netdiscover\", \"legion\",\n  // web enumeration\n  \"gobuster\", \"dirbuster\", \"dirb\", \"wfuzz\", \"ffuf\", \"whatweb\", \"eyewitness\",\n  // web vulnerability scanning\n  \"wpscan\", \"joomscan\", \"droopescan\", \"nikto\", \n  // exploitation tools\n  \"sqlmap\", \"commix\", \"yersinia\",\n  // cracking and brute forcing\n  \"john\", \"hashcat\", \"hydra\", \"ncrack\", \"cewl\", \"fcrackzip\", \"rainbowcrack\",\n  // host and network\n  \"linenum.sh\", \"linpeas.sh\", \"pspy32\", \"pspy32s\", \"pspy64\", \"pspy64s\", \"binwalk\", \"evil-winrm\"\n)\n","filters":[],"actions":[]}
{"id":"8a51ade9-fa58-496e-8fef-69ada2129bda","updated_at":"2024-04-13T20:11:23.012Z","updated_by":"elastic","created_at":"2024-04-13T19:58:16.024Z","created_by":"elastic","name":"List gpg keys","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Identify when gpg keys are listed","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://127.0.0.1:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"4c79348e-7465-4156-961b-67e0c3313637","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007"},"technique":[{"id":"T1083","name":"File and Directory Discovery","reference":"https://attack.mitre.org/techniques/T1083","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"event.category : \"process\" and event.action : \"exec\" and process.command_line: \"gpg --list-keys\"","filters":[],"actions":[]}
{"id":"0b95cdf0-01c9-4749-8b0d-a8dd7f54f98c","updated_at":"2024-04-13T20:11:34.771Z","updated_by":"elastic","created_at":"2024-04-13T20:08:34.387Z","created_by":"elastic","name":"Get root shell","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Identify when root shell is obtained","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://127.0.0.1:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"27e2d74a-7c0b-4ac3-a263-f81b08de3180","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004"},"technique":[{"id":"T1068","name":"Exploitation for Privilege Escalation","reference":"https://attack.mitre.org/techniques/T1068","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"user.name : root and event.category : \"process\" and process.name : bash and not process.parent.real_user.name : root and event.action : \"exec\"","filters":[],"actions":[]}
{"id":"7bd6d317-f5b8-4311-b4b0-f0b978b2b312","updated_at":"2024-04-13T20:11:42.323Z","updated_by":"elastic","created_at":"2024-04-13T19:47:15.703Z","created_by":"elastic","name":"Flag found","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"identify when the flag is found","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://127.0.0.1:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"9addaad2-9144-45f7-bc20-1778544c18e4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0009","name":"Collection","reference":"https://attack.mitre.org/tactics/TA0009"},"technique":[{"id":"T1005","name":"Data from Local System","reference":"https://attack.mitre.org/techniques/T1005","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"event.category : \"process\" and event.action : \"text_output\" and process.command_line : *flag.txt* and user.name : \"root\"","filters":[],"actions":[]}
{"id":"746b7ffc-7773-4211-b453-0a4548ce03b2","updated_at":"2024-04-13T20:11:28.396Z","updated_by":"elastic","created_at":"2024-04-13T20:03:08.181Z","created_by":"elastic","name":"Decrypt File","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Identify when archivo.txt is decrypted","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://127.0.0.1:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"518108b4-248b-430b-8045-f021fece42c8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006"},"technique":[{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"event.category : \"process\" and event.action : \"exec\" and process.args : \"gpg\" and process.args : \"-d\" and process.args : *archivo.txt","filters":[],"actions":[]}
{"id":"76864a2e-f50c-42d1-aef0-d0c35ed1f591","updated_at":"2024-04-13T20:16:59.358Z","updated_by":"elastic","created_at":"2024-04-13T20:16:51.459Z","created_by":"elastic","name":"Process Capability Enumeration [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Data Source: Elastic Defend","Data Source: Elastic Endgame"],"interval":"5m","enabled":true,"revision":1,"description":"Identifies recursive process capability enumeration of the entire filesystem through the getcap command. Malicious users may manipulate identified capabilities to gain root privileges.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"0ff22358-c1f9-4308-8a03-363fc278bf5c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1057","name":"Process Discovery","reference":"https://attack.mitre.org/techniques/T1057/","subtechnique":[]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*","endgame-*"],"query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"exec_event\") and\nprocess.name == \"getcap\" and process.args == \"-r\" and process.args == \"/\" and process.args_count == 3 and\nuser.id != \"0\"\n","filters":[],"actions":[]}
{"id":"7b32b9d2-b403-45a5-9834-56f18195ebe8","updated_at":"2024-04-13T20:17:50.363Z","updated_by":"elastic","created_at":"2024-04-13T20:17:42.592Z","created_by":"elastic","name":"Sudo Command Enumeration Detected [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Data Source: Elastic Defend"],"interval":"5m","enabled":true,"revision":1,"description":"This rule monitors for the usage of the sudo -l command, which is used to list the allowed and forbidden commands for the invoking user. Attackers may execute this command to enumerate commands allowed to be executed with sudo permissions, potentially allowing to escalate privileges to root.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"8df0fe86-c98a-4060-b75f-5e6e05233543","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1033","name":"System Owner/User Discovery","reference":"https://attack.mitre.org/techniques/T1033/","subtechnique":[]}]}],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*"],"query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and \nprocess.name == \"sudo\" and process.args == \"-l\" and process.args_count == 2 and\nprocess.parent.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\") and \nnot group.Ext.real.id : \"0\" and not user.Ext.real.id : \"0\" and not process.args == \"dpkg\"\n","filters":[],"actions":[]}
{"id":"6e598125-ce50-4043-b4e3-eb863a26bb70","updated_at":"2024-04-13T20:17:31.990Z","updated_by":"elastic","created_at":"2024-04-13T20:17:23.395Z","created_by":"elastic","name":"Potential Shell via Wildcard Injection Detected [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Privilege Escalation","Tactic: Execution","Data Source: Elastic Defend"],"interval":"5m","enabled":true,"revision":1,"description":"This rule monitors for the execution of a set of linux binaries, that are potentially vulnerable to wildcard injection, with suspicious command line flags followed by a shell spawn event. Linux wildcard injection is a type of security vulnerability where attackers manipulate commands or input containing wildcards (e.g., *, ?, []) to execute unintended operations or access sensitive data by tricking the system into interpreting the wildcard characters in unexpected ways.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"ca38ffe8-1494-4974-9f30-7e728b29bbd5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1068","name":"Exploitation for Privilege Escalation","reference":"https://attack.mitre.org/techniques/T1068/","subtechnique":[]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[]}]}],"to":"now","references":["https://www.exploit-db.com/papers/33930"],"version":5,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*"],"query":"sequence by host.id with maxspan=1s\n  [process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n    (process.name == \"tar\" and process.args : \"--checkpoint=*\" and process.args : \"--checkpoint-action=*\") or\n    (process.name == \"rsync\" and process.args : \"-e*\") or\n    (process.name == \"zip\" and process.args == \"--unzip-command\") )]  by process.entity_id\n  [process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and \n     process.parent.name : (\"tar\", \"rsync\", \"zip\") and \n     process.name : (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\")] by process.parent.entity_id\n","filters":[],"actions":[]}
{"id":"a6aa2b83-38e0-4df2-b5f2-e59cd47a7822","updated_at":"2024-04-13T20:18:12.616Z","updated_by":"elastic","created_at":"2024-04-13T20:18:04.772Z","created_by":"elastic","name":"Linux Restricted Shell Breakout via Linux Binary(s) [Duplicate]","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Execution","Data Source: Elastic Endgame","Data Source: Elastic Defend"],"interval":"5m","enabled":true,"revision":1,"description":"Identifies the abuse of a Linux binary to break out of a restricted shell or environment by spawning an interactive system shell. The activity of spawning a shell from a binary is not common behavior for a user or system administrator, and may indicate an attempt to evade detection, increase capabilities or enhance the stability of an adversary.","risk_score":47,"severity":"medium","note":"## Triage and analysis\n\n### Investigating Shell Evasion via Linux Utilities\nDetection alerts from this rule indicate that a Linux utility has been abused to breakout of restricted shells or\nenvironments by spawning an interactive system shell.\nHere are some possible avenues of investigation:\n- Examine the entry point to the host and user in action via the Analyse View.\n  - Identify the session entry leader and session user\n- Examine the contents of session leading to the abuse via the Session View.\n  - Examine the command execution pattern in the session, which may lead to suspricous activities\n- Examine the execution of commands in the spawned shell.\n  - Identify imment threat to the system from the executed commands\n  - Take necessary incident response actions to contain any malicious behviour caused via this execution.\n\n### Related rules\n\n- A malicious spawned shell can execute any of the possible MITTRE ATT&CK vectors mainly to impair defences.\n- Hence its adviced to enable defence evasion and privilige escalation rules accordingly in your environment\n\n### Response and remediation\n\nInitiate the incident response process based on the outcome of the triage.\n\n- If the triage releaved suspicious netwrok activity from the malicious spawned shell,\n  - Isolate the involved host to prevent further post-compromise behavior.\n- If the triage identified malware execution via the maliciously spawned shell,\n  - Search the environment for additional compromised hosts.\n  - Implement temporary network rules, procedures, and segmentation to contain the malware.\n  - Stop suspicious processes.\n  - Immediately block the identified indicators of compromise (IoCs).\n  - Inspect the affected systems for additional malware backdoors like reverse shells, reverse proxies, or droppers that attackers could use to reinfect the system.\n- If the triage revelaed defence evasion for imparing defenses\n  - Isolate the involved host to prevent further post-compromise behavior.\n  - Identified the disabled security guard components on the host and take necessary steps in renebaling the same.\n  - If any tools have been disbaled / uninstalled or config tampered work towards reenabling the same.\n- If the triage revelaed addition of persistence mechanism exploit like auto start scripts\n  - Isolate further login to the systems that can initae auto start scripts.\n  - Identify the auto start scripts and disable and remove the same from the systems\n- If the triage revealed data crawling or data export via remote copy\n  - Investigate credential exposure on systems compromised / used / decoded by the attacker during the data crawling\n  - Intiate compromised credential deactivation and credential rotation process for all exposed crednetials.\n  - Investiagte if any IPR data was accessed during the data crawling and take appropriate actions.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).\n","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"ee31f5d6-f65b-4c75-af0e-8697f7840262","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.004","name":"Unix Shell","reference":"https://attack.mitre.org/techniques/T1059/004/"}]}]}],"to":"now","references":["https://gtfobins.github.io/gtfobins/apt/","https://gtfobins.github.io/gtfobins/apt-get/","https://gtfobins.github.io/gtfobins/nawk/","https://gtfobins.github.io/gtfobins/mawk/","https://gtfobins.github.io/gtfobins/awk/","https://gtfobins.github.io/gtfobins/gawk/","https://gtfobins.github.io/gtfobins/busybox/","https://gtfobins.github.io/gtfobins/c89/","https://gtfobins.github.io/gtfobins/c99/","https://gtfobins.github.io/gtfobins/cpulimit/","https://gtfobins.github.io/gtfobins/crash/","https://gtfobins.github.io/gtfobins/env/","https://gtfobins.github.io/gtfobins/expect/","https://gtfobins.github.io/gtfobins/find/","https://gtfobins.github.io/gtfobins/flock/","https://gtfobins.github.io/gtfobins/gcc/","https://gtfobins.github.io/gtfobins/mysql/","https://gtfobins.github.io/gtfobins/nice/","https://gtfobins.github.io/gtfobins/ssh/","https://gtfobins.github.io/gtfobins/vi/","https://gtfobins.github.io/gtfobins/vim/","https://gtfobins.github.io/gtfobins/capsh/","https://gtfobins.github.io/gtfobins/byebug/","https://gtfobins.github.io/gtfobins/git/","https://gtfobins.github.io/gtfobins/ftp/"],"version":112,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*"],"query":"process where host.os.type == \"linux\" and event.type == \"start\" and\n(\n  /* launching shell from capsh */\n  (process.name == \"capsh\" and process.args == \"--\") or\n  \n  /* launching shells from unusual parents or parent+arg combos */\n  (process.name in (\"bash\", \"dash\", \"ash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\") and (\n    (process.parent.name : \"*awk\" and process.parent.args : \"BEGIN {system(*)}\") or\n    (process.parent.name == \"git\" and process.parent.args : (\"*PAGER*\", \"!*sh\", \"exec *sh\") or \n     process.args : (\"*PAGER*\", \"!*sh\", \"exec *sh\") and not process.name == \"ssh\" ) or\n    (process.parent.name : (\"byebug\", \"ftp\", \"strace\", \"zip\", \"tar\") and \n    (\n      process.parent.args : \"BEGIN {system(*)}\" or\n      (process.parent.args : (\"*PAGER*\", \"!*sh\", \"exec *sh\") or process.args : (\"*PAGER*\", \"!*sh\", \"exec *sh\")) or\n      (\n        (process.parent.args : \"exec=*sh\" or (process.parent.args : \"-I\" and process.parent.args : \"*sh\")) or\n        (process.args : \"exec=*sh\" or (process.args : \"-I\" and process.args : \"*sh\"))\n        )\n      )\n    ) or\n    \n    /* shells specified in parent args */\n    /* nice rule is broken in 8.2 */\n    (process.parent.args : \"*sh\" and\n      (\n        (process.parent.name == \"nice\") or\n        (process.parent.name == \"cpulimit\" and process.parent.args == \"-f\") or\n        (process.parent.name == \"find\" and process.parent.args == \".\" and process.parent.args == \"-exec\" and \n         process.parent.args == \";\" and process.parent.args : \"/bin/*sh\") or\n        (process.parent.name == \"flock\" and process.parent.args == \"-u\" and process.parent.args == \"/\")\n      )\n    )\n  )) or\n\n  /* shells specified in args */\n  (process.args : \"*sh\" and (\n    (process.parent.name == \"crash\" and process.parent.args == \"-h\") or\n    (process.name == \"sensible-pager\" and process.parent.name in (\"apt\", \"apt-get\") and process.parent.args == \"changelog\")\n    /* scope to include more sensible-pager invoked shells with different parent process to reduce noise and remove false positives */\n    \n  )) or\n  (process.name == \"busybox\" and event.action == \"exec\" and process.args_count == 2 and process.args : \"*sh\" and not \n   process.executable : \"/var/lib/docker/overlay2/*/merged/bin/busybox\" and not (process.parent.args == \"init\" and\n   process.parent.args == \"runc\") and not process.parent.args in (\"ls-remote\", \"push\", \"fetch\") and not process.parent.name == \"mkinitramfs\") or\n  (process.name == \"env\" and process.args_count == 2 and process.args : \"*sh\") or\n  (process.parent.name in (\"vi\", \"vim\") and process.parent.args == \"-c\" and process.parent.args : \":!*sh\") or\n  (process.parent.name in (\"c89\", \"c99\", \"gcc\") and process.parent.args : \"*sh,-s\" and process.parent.args == \"-wrapper\") or\n  (process.parent.name == \"expect\" and process.parent.args == \"-c\" and process.parent.args : \"spawn *sh;interact\") or\n  (process.parent.name == \"mysql\" and process.parent.args == \"-e\" and process.parent.args : \"\\\\!*sh\") or\n  (process.parent.name == \"ssh\" and process.parent.args == \"-o\" and process.parent.args : \"ProxyCommand=;*sh 0<&2 1>&2\")\n)\n","filters":[],"actions":[]}
{"exported_count":16,"exported_rules_count":16,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}